In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
faccount = pd.read_csv('anomaly-detection_anomaly-detection/faccount.txt')

In [5]:
faccount

,ACCTID,ACCTTYPE,ACCTNAME,FIRSTNAME,SURNAME,DOB,ACCTCREATED,ACCTRISK,ADDRESS,ADDRESS_LAT,ADDRESS_LON,CATEGORY
0,800039,BUSINESS,Young Supermarket,Kevin,Young,1982-02-23T00:00:00,2018-09-20T00:00:00,MEDIUM,BRISBANE,-27.512179,153.073105,Supermarket
1,800040,BUSINESS,Williams Grocery,Lindsay,Williams,1959-02-20T00:00:00,2018-02-24T00:00:00,MEDIUM,BRISBANE,-27.504303,153.073470,Grocery
2,800041,CREDIT,Myers Supermarket,Lisa,Myers,1982-09-04T00:00:00,2018-01-11T00:00:00,HIGH,BRISBANE,-27.484970,153.097588,Supermarket
3,800042,BUSINESS,Martinez Supermarket,Brittany,Martinez,1976-10-11T00:00:00,2018-12-04T00:00:00,MEDIUM,BRISBANE,-27.402357,153.056983,Supermarket
4,800043,CREDIT,Taylor Grocery,David,Taylor,1978-01-23T00:00:00,2019-07-15T00:00:00,MEDIUM,BRISBANE,-27.473628,152.955089,Grocery
...,...,...,...,...,...,...,...,...,...,...,...,...
1995,501232,BUSINESS,"Richard, Morgan",Morgan,Richard,1965-02-22T00:00:00,2016-04-20T00:00:00,LOW,BRISBANE,-27.500806,153.084632,CUSTOMER
1996,501233,CREDIT,"Roberts, Amanda",Amanda,Roberts,1990-06-12T00:00:00,2017-06-03T00:00:00,LOW,BRISBANE,-27.492933,152.984622,CUSTOMER
1997,501234,SAVINGS,"Lopez, Christine",Christine,Lopez,1970-01-15T00:00:00,2017-04-23T00:00:00,MEDIUM,BRISBANE,-27.489311,153.094632,CUSTOMER
1998,501235,CREDIT,"Mullins, Robert",Robert,Mullins,1962-11-08T00:00:00,2018-09-21T00:00:00,MEDIUM,BRISBANE,-27.535691,152.985188,CUSTOMER
1999,501236,SAVINGS,"Collins, Mark",Mark,Collins,1990-12-06T00:00:00,2015-05-16T00:00:00,LOW,BRISBANE,-27.412629,153.024467,CUSTOMER

In [6]:
ftxn2 = pd.read_csv('anomaly-detection_anomaly-detection/ftxn2.txt')

In [7]:
ftxn2

,TXN_ID,TXTYPE,AMOUNT,FROMACCTID,TOACCTID,TXDATE,REFERENCE,ISFRAUD,ISFLAGGED
0,950060711303,PAYMENT,320,500607,800242,2020-01-22T17:00:00,Dinner with Shane,N,Y
1,950060711401,PAYMENT,48,500607,800111,2020-01-23T08:00:00,Breakfast with Steven,N,Y
2,950060711402,TRANSFER,6209,500607,500929,2020-01-23T13:00:00,Holiday Cost,N,Y
3,950060711403,PAYMENT,66,500607,800252,2020-01-23T17:00:00,Meal with Mary,N,Y
4,950060711501,PAYMENT,47,500607,800116,2020-01-24T08:00:00,Coffee with Brian,N,Y
...,...,...,...,...,...,...,...,...,...
1533061,950134025802,TRANSFER,9159,501340,500730,2020-06-15T13:00:00,Water Costs,N,Y
1533062,950134025803,PAYMENT,323,501340,800201,2020-06-15T17:00:00,Meal with Christine,N,Y
1533063,950134025901,PAYMENT,75,501340,800136,2020-06-16T08:00:00,Coffee with Kyle,N,Y
1533064,950134025902,TRANSFER,3997,501340,501193,2020-06-16T13:00:00,Water Costs,N,Y
1533065,950134025903,PAYMENT,211,501340,800254,2020-06-16T17:00:00,Meal with Sarah,N,Y

In [20]:
faccount[faccount.ACCTID==500607]

,ACCTID,ACCTTYPE,ACCTNAME,FIRSTNAME,SURNAME,DOB,ACCTCREATED,ACCTRISK,ADDRESS,ADDRESS_LAT,ADDRESS_LON,CATEGORY
1449,500607,MAXI-SAVER,"Smith, Elizabeth",Elizabeth,Smith,1961-11-25T00:00:00,2018-10-30T00:00:00,LOW,BRISBANE,-27.42151,153.049456,CUSTOMER

In [21]:
faccount[faccount.ACCTID==800242]

,ACCTID,ACCTTYPE,ACCTNAME,FIRSTNAME,SURNAME,DOB,ACCTCREATED,ACCTRISK,ADDRESS,ADDRESS_LAT,ADDRESS_LON,CATEGORY
280,800242,CREDIT,Marshall Restaurant,Taylor,Marshall,1961-01-11T00:00:00,2016-05-13T00:00:00,LOW,BRISBANE,-27.481017,153.001146,Restaurant

In [22]:
faccount.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   ACCTID       2000 non-null   int64
 1   ACCTTYPE     2000 non-null   object
 2   ACCTNAME     2000 non-null   object
 3   FIRSTNAME    2000 non-null   object
 4   SURNAME      2000 non-null   object
 5   DOB          2000 non-null   object
 6   ACCTCREATED  2000 non-null   object
 7   ACCTRISK     2000 non-null   object
 8   ADDRESS      2000 non-null   object
 9   ADDRESS_LAT  2000 non-null   float64
 10  ADDRESS_LON  2000 non-null   float64
 11  CATEGORY     2000 non-null   object
dtypes: float64(2), int64(1), object(9)
memory usage: 187.6+ KB